app/views/patients/show.html.erb

SELECT "doctors".* FROM "doctors" INNER JOIN "appointments" ON "doctors"."id" = "appointments"."doctor_id" WHERE "appointments"."patient_id" = $1  [["patient_id", 2]]
---
    <ol>
    <% @patient.doctors.uniq.each do |doctor| %>

SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = $1  ORDER BY "appointments"."fecha" ASC, "appointments"."hora" ASC  [["patient_id", 2]]
---
  <ol>
    <% @patient.appointments.order(:fecha).order(:hora).each do |appointment| %>