app/controllers/appointment_reports_controller.rb

SELECT "appointment_reports".* FROM "appointment_reports"
---
  def index
    @appointment_reports = AppointmentReport.all

INSERT INTO "appointment_reports" ("diagnostico", "tratamiento", "informe_medico", "appointment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @appointment_report = AppointmentReport.new(appointment_report_params)

    respond_to do |format|
      if @appointment_report.save

UPDATE "appointment_reports" SET "diagnostico" = $1, "updated_at" = $2 WHERE "appointment_reports"."id" = $3  [["diagnostico", "esta mal x"], ["updated_at", "2015-05-05 18:05:45.392282"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @appointment_report.update(appointment_report_params)

SELECT  "appointment_reports".* FROM "appointment_reports" WHERE "appointment_reports"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_appointment_report
      @appointment_report = AppointmentReport.find(params[:id])