app/controllers/appointments_controller.rb

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."user_id" = $1 LIMIT 1  [["user_id", 2]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = $1  ORDER BY "appointments"."hora" ASC  [["doctor_id", 7]]
SELECT "appointments".* FROM "appointments" WHERE (fecha = '2015-05-04')  ORDER BY "appointments"."hora" ASC
---
  def index
    if current_user.tipo == "medico"
      doctor = Doctor.find_by(user_id: current_user.id)
      @appointments = Appointment.where(doctor_id: doctor.id).order(:hora).paginate(:per_page => 6, :page => params[:page])
    else
      @appointments = Appointment.all.order(:hora).paginate(:per_page => 4, :page => params[:page])

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."user_id" = $1 LIMIT 1  [["user_id", 12]]
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."fecha" = '2015-05-05'  ORDER BY "appointments"."hora" ASC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."fecha" = '2015-05-05'
---
  def citas_del_dia
    if current_user.tipo == "medico"
      doctor = Doctor.find_by(user_id: current_user.id)
      @appointments = Appointment.where("fecha = ? AND doctor_id = ?", DateTime.now.to_date, doctor.id).order(:hora).paginate(:per_page => 4, :page => params[:page])

SELECT  "appointments".* FROM "appointments" WHERE (fecha >= '2015-05-05' AND doctor_id = '6')  ORDER BY "appointments"."fecha" ASC, "appointments"."hora" ASC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "appointments" WHERE (fecha >= '2015-05-05' AND doctor_id = '6')
---
  def citas_por_doctor
    @appointments = Appointment.where("fecha >= ? AND doctor_id = ?", DateTime.now.to_date, params[:doctor_id]).order(:fecha).order(:hora).paginate(:per_page => 4, :page => params[:page])

UPDATE "appointments" SET "estado" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["estado", "f"], ["updated_at", "2015-05-04 17:10:22.560832"], ["id", 1]]
---
  def cancelar
    @appointment.update_attribute(:estado, false)

UPDATE "appointments" SET "estado" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["estado", "t"], ["updated_at", "2015-05-04 17:18:14.509730"], ["id", 1]]
---
  def reactivar
    @appointment.update_attribute(:estado, true)

INSERT INTO "appointments" ("apellido", "nombre", "cedula", "telefono", "menor", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["apellido", ""], ["nombre", ""], ["cedula", ""], ["telefono", ""], ["menor", "f"], ["created_at", "2015-05-02 04:41:39.693799"], ["updated_at", "2015-05-02 04:41:39.693799"]]
---
  def create
    @appointment = Appointment.new(appointment_params)
    if params[:cedula_paciente].blank?
      flash.keep[:notice] = "Por favor introduzca una cedula valida"
      render :new
    elsif Patient.existente(params[:cedula_paciente])
      @appointment.patient_id = Patient.existente(params[:cedula_paciente]).id
    respond_to do |format|
      if @appointment.save

UPDATE "appointments" SET "motivo" = $1, "fecha" = $2, "hora" = $3, "patient_id" = $4, "doctor_id" = $5, "updated_at" = $6 WHERE "appointments"."id" = $7  [["motivo", "me duele el culo"], ["fecha", "2015-05-01"], ["hora", "2000-01-01 06:00:00.000000"], ["patient_id", 1], ["doctor_id", 2], ["updated_at", "2015-05-02 05:13:17.000197"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @appointment.update(appointment_params)