app/controllers/appointments_controller.rb

  def index
    if current_user.tipo == "medico"
      doctor = Doctor.find_by(user_id: current_user.id)
      @appointments = Appointment.search(params[:search]).where(doctor_id: doctor.id).order(:hora).paginate(:per_page => 6, :page => params[:page])
    else
      @appointments = Appointment.search(params[:search]).paginate(:per_page => 4, :page => params[:page])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = $1  [["doctor_id", 1]]