app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.search(params[:search]).paginate(:per_page => 6, :page => params[:page])
---
SELECT "doctors"."id" FROM "doctors" WHERE (nombre like '%dexter%' AND apellido like '%martinez%')
SELECT COUNT(*) FROM "doctors"

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("nombre", "apellido", "especialidad", "cedula", "direccion", "telefono1", "telefono2", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @doctor.update(doctor_params)
---
UPDATE "doctors" SET "especialidad" = $1, "direccion" = $2, "telefono1" = $3, "telefono2" = $4, "updated_at" = $5 WHERE "doctors"."id" = $6  [["especialidad", "anologo"], ["direccion", "lomas del avila"], ["telefono1", "04149234324"], ["telefono2", "02122717461"], ["updated_at", "2015-05-05 14:50:42.042982"], ["id", 1]]