app/controllers/patients_controller.rb

  def index
    @patients = Patient.search(params[:search]).paginate(:per_page => 6, :page => params[:page])
---
SELECT "patients"."id" FROM "patients" WHERE (cedula like 18809098)
SELECT COUNT(*) FROM "patients"

  def edit
    if @patient.medical_history.blank?
---
SELECT  "medical_histories".* FROM "medical_histories" WHERE "medical_histories"."patient_id" = $1 LIMIT 1  [["patient_id", 6]]

  def create
    @patient = Patient.new(patient_params)
    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("cedula", "num_hist_medica", "apellido", "nombre", "edad", "estado_civil", "telefono", "direccion", "fecha_nacimiento", "fecha_ingreso", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    respond_to do |format|
      if @patient.update(patient_params)
---
UPDATE "patients" SET "cedula" = $1, "num_hist_medica" = $2, "estado_civil" = $3, "telefono" = $4, "direccion" = $5, "updated_at" = $6 WHERE "patients"."id" = $7  [["cedula", "18809098"], ["num_hist_medica", ""], ["estado_civil", ""], ["telefono", ""], ["direccion", ""], ["updated_at", "2015-05-06 07:03:04.696705"], ["id", 18]]

  def destroy
    @patient.destroy
---
DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 6]]