app/controllers/pediatric_controls_controller.rb

  def index
    @pediatric_controls = PediatricControl.all
---
SELECT "pediatric_controls".* FROM "pediatric_controls"

  def create
    @pediatric_control = PediatricControl.new(pediatric_control_params)

    respond_to do |format|
      if @pediatric_control.save
---
INSERT INTO "pediatric_controls" ("bcg1", "sarampion", "otras", "observaciones", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bcg1", "2015-05-06"], ["sarampion", "2015-05-06"], ["otras", ""], ["observaciones", ""], ["created_at", "2015-05-06 06:16:20.500755"], ["updated_at", "2015-05-06 06:16:20.500755"]]

  def destroy
    @pediatric_control.destroy
---
DELETE FROM "pediatric_controls" WHERE "pediatric_controls"."id" = $1  [["id", 1]]

    def set_pediatric_control
      @pediatric_control = PediatricControl.find(params[:id])
---
SELECT  "pediatric_controls".* FROM "pediatric_controls" WHERE "pediatric_controls"."id" = $1 LIMIT 1  [["id", 2]]