app/controllers/pediatric_histories_controller.rb

  def index
    @pediatric_histories = PediatricHistory.all
---
SELECT "pediatric_histories".* FROM "pediatric_histories"