app/controllers/pediatric_patients_controller.rb

SELECT "pediatric_patients".* FROM "pediatric_patients"
---
  def index
    @pediatric_patients = PediatricPatient.all

INSERT INTO "pediatric_patients" ("nombre", "apellido", "telefono_padre", "telefono_madre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", ""], ["apellido", ""], ["telefono_padre", ""], ["telefono_madre", ""], ["created_at", "2015-05-06 07:01:54.341963"], ["updated_at", "2015-05-06 07:01:54.341963"]]
---
  def create
    @pediatric_patient = PediatricPatient.new(pediatric_patient_params)

    respond_to do |format|
      if @pediatric_patient.save

SELECT  "pediatric_patients".* FROM "pediatric_patients" WHERE "pediatric_patients"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_pediatric_patient
      @pediatric_patient = PediatricPatient.find(params[:id])