app/views/appointments/_form.html.erb

    <%= f.label :paciente %><br>
    <%= f.collection_select(:patient_id, Patient.all , :id, :nombre, {:include_blank => true}, {:multiple => false})  %>
---
SELECT "patients".* FROM "patients"

    <%= f.label :doctor %><br>
    <%= f.collection_select(:doctor_id, Doctor.all, :id, :nombre, {:include_blank => true}, {:multiple => false})  %>
---
SELECT "doctors".* FROM "doctors"